; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v1 - type_1 ?v6 - type_3)
 	      (pred_1 ?v4 - object ?v6 - type_3)
	      (pred_2 ?v1 - type_1 ?v3 - type_2)
	      (pred_3 ?v1 - type_1 ?v4 - object ?v3 - type_2))

   (:action op_3
       :parameters  (?v1 - type_1 ?v2 ?v7 - type_3)
       :precondition (and  (pred_4 ?v1 ?v2))
       :effect (and  (pred_4 ?v1 ?v7)
		     (not (pred_4 ?v1 ?v2))))

   (:action op_2
       :parameters (?v1 - type_1 ?v8 - object ?v5 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_1 ?v8 ?v5) (pred_4 ?v1 ?v5) (pred_2 ?v1 ?v3))
       :effect (and (pred_3 ?v1 ?v8 ?v3)
		    (not (pred_1 ?v8 ?v5)) 
		    (not (pred_2 ?v1 ?v3))))

   (:action op_1
       :parameters (?v1 - type_1 ?v8 - object ?v5 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v8 ?v3) (pred_4 ?v1 ?v5))
       :effect (and (pred_1 ?v8 ?v5)
		    (pred_2 ?v1 ?v3)
		    (not (pred_3 ?v1 ?v8 ?v3)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_02 obj_11 - type_1
obj_08 obj_09 obj_03 obj_04 - type_2
obj_13 obj_06 obj_05 obj_12 - type_3
obj_10 obj_07 obj_01 - object)
(:init
(pred_4 obj_02 obj_05)
(pred_2 obj_02 obj_08)
(pred_2 obj_02 obj_09)
(pred_4 obj_11 obj_05)
(pred_2 obj_11 obj_03)
(pred_2 obj_11 obj_04)
(pred_1 obj_10 obj_06)
(pred_1 obj_07 obj_13)
(pred_1 obj_01 obj_06)
)
(:goal
(and
(pred_1 obj_10 obj_06)
(pred_1 obj_07 obj_06)
(pred_1 obj_01 obj_13)
)
)

(:constraints
  (always (not (pred_4 obj_02 obj_06)))
)
)

; plan
1. (op_3 obj_02 obj_05 obj_13)
   deleted: (pred_4 obj_02 obj_05)
   added: (pred_4 obj_02 obj_13)
   goals met: 1 of 3
2. (op_3 obj_11 obj_05 obj_13)
   deleted: (pred_4 obj_11 obj_05)
   added: (pred_4 obj_11 obj_13)
   goals met: 1 of 3
3. (op_3 obj_02 obj_13 obj_12)
   deleted: (pred_4 obj_02 obj_13)
   added: (pred_4 obj_02 obj_12)
   goals met: 1 of 3
4. (op_2 obj_11 obj_07 obj_13 obj_04)
   deleted: (pred_1 obj_07 obj_13) (pred_2 obj_11 obj_04)
   added: (pred_3 obj_11 obj_07 obj_04)
   goals met: 1 of 3
5. (op_3 obj_11 obj_13 obj_06)
   deleted: (pred_4 obj_11 obj_13)
   added: (pred_4 obj_11 obj_06)
   goals met: 1 of 3
6. (op_1 obj_11 obj_07 obj_06 obj_04)
   deleted: (pred_3 obj_11 obj_07 obj_04)
   added: (pred_1 obj_07 obj_06) (pred_2 obj_11 obj_04)
   goals met: 2 of 3
7. (op_2 obj_11 obj_01 obj_06 obj_03)
   deleted: (pred_1 obj_01 obj_06) (pred_2 obj_11 obj_03)
   added: (pred_3 obj_11 obj_01 obj_03)
   goals met: 2 of 3
8. (op_3 obj_11 obj_06 obj_13)
   deleted: (pred_4 obj_11 obj_06)
   added: (pred_4 obj_11 obj_13)
   goals met: 2 of 3
9. (op_1 obj_11 obj_01 obj_13 obj_03)
   deleted: (pred_3 obj_11 obj_01 obj_03)
   added: (pred_1 obj_01 obj_13) (pred_2 obj_11 obj_03)
   goals met: 3 of 3
